app/controllers/documents_controller.rb

  def create
    @document = Document.new(document_params)
    @document.user_id = current_user.id

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("title", "body", "user_id", "created_at", "updated_at", "receiver") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["body", ""], ["user_id", 1], ["created_at", "2018-12-18 10:12:21.709431"], ["updated_at", "2018-12-18 10:12:21.709431"], ["receiver", "Выберите"]]

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE "documents" SET "title" = $1, "body" = $2, "receiver" = $3, "updated_at" = $4 WHERE "documents"."id" = $5  [["title", "Завещание 1"], ["body", "Текст моего завещания"], ["receiver", "mary@gmail.com"], ["updated_at", "2018-12-20 15:04:48.938005"], ["id", 48]]

  def destroy
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 46]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]