app/controllers/instructions_controller.rb

INSERT INTO "instructions" ("title", "body", "user_id", "created_at", "updated_at", "receiver") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["body", ""], ["user_id", 1], ["created_at", "2019-02-07 09:11:40.285949"], ["updated_at", "2019-02-07 09:11:40.285949"], ["receiver", "Выберите"]]
---
  def create
    @instruction = Instruction.new(instruction_params)
    @document.user_id = current_user.id

    respond_to do |format|
      if @instruction.save

DELETE FROM "instructions" WHERE "instructions"."id" = $1  [["id", 9]]
---
  def destroy
    @instruction.destroy

SELECT  "instructions".* FROM "instructions" WHERE "instructions"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_instruction
      @instruction = Instruction.find(params[:id])