app/controllers/social_accounts_controller.rb

  def create
    @social_account = SocialAccount.new(social_account_params)
    @social_account.user_id = current_user.id

    respond_to do |format|
      if @social_account.save
---
INSERT INTO "social_accounts" ("title", "body", "user_id", "created_at", "updated_at", "login", "receiver", "password", "action") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @social_account.update(social_account_params)
---
UPDATE "social_accounts" SET "title" = $1, "updated_at" = $2 WHERE "social_accounts"."id" = $3  [["title", "YouTube"], ["updated_at", "2018-12-20 15:07:29.140717"], ["id", 23]]

  def destroy
    @social_account.destroy
---
DELETE FROM "social_accounts" WHERE "social_accounts"."id" = $1  [["id", 20]]

    def set_social_account
      @social_account = SocialAccount.find(params[:id])
---
SELECT  "social_accounts".* FROM "social_accounts" WHERE "social_accounts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]