app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("title", "body", "user_id", "created_at", "updated_at", "receiver", "login", "password") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @subscription = Subscription.new(subscription_params)
    @document.user_id = current_user.id

    respond_to do |format|
      if @subscription.save

UPDATE "subscriptions" SET "title" = $1, "body" = $2, "login" = $3, "password" = $4, "updated_at" = $5 WHERE "subscriptions"."id" = $6  [["title", "www.tvrain.ru"], ["body", ""], ["login", ""], ["password", ""], ["updated_at", "2018-12-20 15:11:46.076826"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @subscription.update(subscription_params)

DELETE FROM "subscriptions" WHERE "subscriptions"."id" = $1  [["id", 2]]
---
  def destroy
    @subscription.destroy

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_subscription
      @subscription = Subscription.find(params[:id])