app/controllers/transmit_controller.rb

  def index
    @documents = Document.all
    @instructions = Instruction.all
    @social_accounts = SocialAccount.all
    @subscriptions = Subscription.all
    @wallets = Wallet.all
---
SELECT "documents".* FROM "documents"
SELECT "instructions".* FROM "instructions"
SELECT "social_accounts".* FROM "social_accounts"
SELECT "subscriptions".* FROM "subscriptions"
SELECT "wallets".* FROM "wallets"