app/controllers/wallets_controller.rb

INSERT INTO "wallets" ("title", "body", "user_id", "created_at", "updated_at", "password", "login", "receiver") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @wallet = Wallet.new(wallet_params)
    @wallet.user_id = current_user.id

    respond_to do |format|
      if @wallet.save

UPDATE "wallets" SET "body" = $1, "receiver" = $2, "login" = $3, "password" = $4, "updated_at" = $5 WHERE "wallets"."id" = $6  [["body", "Мой чудесный комментрарий"], ["receiver", "mary@gmail.com"], ["login", "Мой логин"], ["password", "Мой пароль"], ["updated_at", "2018-12-20 15:15:35.990488"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @wallet.update(wallet_params)

DELETE FROM "wallets" WHERE "wallets"."id" = $1  [["id", 4]]
---
  def destroy
    @wallet.destroy

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_wallet
      @wallet = Wallet.find(params[:id])